public class WithoutMult {
    public static void main(String[] args) {
        /*Составьте программу, вычисляющую A*B, не пользуясь операциейумножения.*/

        int a=2;
        int b=-2;
        int q=0;
        for(int i=1;i<=a;i++){
            int c=b;
            q+=c;
                        }

        System.out.println("Произведение А на В равно: "+q);

    }
}
